* Jakobshavn95D_I2
:PROPERTIES:
:header-args:jupyter-python+: :session ds :kernel ds
:clearpage: t
:END:

#+NAME: ingest_meta
#+BEGIN_SRC bash :results verbatim :exports results
cat meta.bsv | sed 's/|/@| /' | column -s"@" -t
#+END_SRC

#+RESULTS: ingest_meta
#+begin_example
Borehole ID                      | Jakobshavn95D_I2
Place name                       | Jakobshavn Isbræ
Geographic location              | Central West Greenland
Ice type                         | Ice sheet
Data Source                      | Lüthi email
Data DOI                         | 
Science Source                   | Lüthi, Martin, Funk, Martin, Iken, Almut, Gogineni, Shivaprasad, Truffer, Martin: Mechanisms of fast flow in Jakobshavns Isbræ, West Greenland: Part III. Measurements of ice deformation, temperature and cross-borehole conductivity in boreholes to the bedrock, Journal of Glaciology 48(162), 369–385, 2002 
Science DOI                      | 10.3189/172756502781831322
Date                             | 1995
Longitude [°E]                   | -48.6871
Latitude [°N]                    | 69.235
Location Source                  | 10.5194/essd-2021-290
Depth of top measurement [m]     | 258.0
Depth of bottom measurement [m]  | 832
Ice thickness [m]                | 832
Coverage [% of thickness]        | 69
Ice thickness source             | See science reference
Note                             | Location from Geothermal Database
#+end_example

** Temperature

** Thickness

** Location

** Velocity

** Data                                                 :noexport:

#+BEGIN_SRC jupyter-python
import pandas as pd
df = pd.read_csv('../Jakobshavn95D_I1/temp_depth95.txt', sep='\s+', comment='%', index_col=0, names=['d','t'], usecols=(0,1))
df.iloc[10:18].to_csv('data.csv', float_format='%.3f')
#+END_SRC

#+RESULTS:

#+NAME: ingest_data
#+BEGIN_SRC bash :exports results
cat data.csv | sort -t, -g -k1
#+END_SRC

#+RESULTS: ingest_data
|      d |       t |
| 258.05 | -18.221 |
| 559.28 | -21.224 |
| 609.49 | -19.807 |
| 659.64 | -16.617 |
| 759.85 |  -3.395 |
| 829.95 |  -0.592 |
|  831.9 |  -0.586 |
|  832.8 |  -0.583 |

